Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
       + "timestamp" = "1754276082576924000"
        }
    }

  # module.pgxflow[0].module.lambda-batchSubmit.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-batchSubmit"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-batchSubmit"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-batchSubmit-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-batchSubmit"
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-batchSubmit-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-batchSubmit"
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Batch submission of PGxFlow jobs"
      + filename                       = "builds/8511bf7117cd06990fba0983ceb7fe9b184980901acac8d9cda7332ceb8cd98a.zip"
      + function_name                  = "pgxflow-backend-batchSubmit"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/batchSubmit",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/8511bf7117cd06990fba0983ceb7fe9b184980901acac8d9cda7332ceb8cd98a.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8511bf7117cd06990fba0983ceb7fe9b184980901acac8d9cda7332ceb8cd98a.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/8511bf7117cd06990fba0983ceb7fe9b184980901acac8d9cda7332ceb8cd98a.zip"
          + "timestamp" = "1754276082738682000"
        }
    }

  # module.pgxflow[0].module.lambda-getResultsURL.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-getResultsURL"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-getResultsURL"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-getResultsURL-0"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/clinical-workflows/*"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Query",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-project-users",
                          + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "pgxflow-backend-getResultsURL"
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-getResultsURL-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-getResultsURL"
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Returns the presigned results URL for PGxFlow results"
      + filename                       = "builds/c2e5089ce5f149efd73e6449704d971fa1f256bb2fc25a9993b88eee92f83806.zip"
      + function_name                  = "pgxflow-backend-getResultsURL"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DPORTAL_BUCKET"             = "gaspi-dataportal20250519062439005900000006"
              + "DYNAMO_CLINIC_JOBS_TABLE"   = "sbeacon-dataportal-clinic-jobs"
              + "DYNAMO_PROJECT_USERS_TABLE" = "sbeacon-dataportal-project-users"
              + "LOOKUP_CONFIGURATION"       = jsonencode(
                    {
                      + assoc_matrix_filename = "RSIGNG_association_matrix.csv"
                      + chr_header            = "chr"
                      + end_header            = "end"
                      + start_header          = "start"
                    }
                )
              + "PHARMCAT_CONFIGURATION"     = jsonencode(
                    {
                      + DRUGS         = []
                      + GENES         = []
                      + ORGANISATIONS = []
                    }
                )
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/getResultsURL",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/c2e5089ce5f149efd73e6449704d971fa1f256bb2fc25a9993b88eee92f83806.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/c2e5089ce5f149efd73e6449704d971fa1f256bb2fc25a9993b88eee92f83806.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/c2e5089ce5f149efd73e6449704d971fa1f256bb2fc25a9993b88eee92f83806.zip"
          + "timestamp" = "1754276082486993000"
        }
    }

  # module.pgxflow[0].module.lambda-initFlow.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-initFlow"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-initFlow"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-initFlow-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-initFlow"
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-initFlow-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-initFlow"
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Initializes a PGxFlow job"
      + filename                       = "builds/842e171f0a8ec7afebff3e89bf0e631ae34ba4b6e134ca1af6ce7bc8ba5d723a.zip"
      + function_name                  = "pgxflow-backend-initFlow"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.lambda-initFlow.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/initFlow",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/842e171f0a8ec7afebff3e89bf0e631ae34ba4b6e134ca1af6ce7bc8ba5d723a.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/842e171f0a8ec7afebff3e89bf0e631ae34ba4b6e134ca1af6ce7bc8ba5d723a.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/842e171f0a8ec7afebff3e89bf0e631ae34ba4b6e134ca1af6ce7bc8ba5d723a.zip"
          + "timestamp" = "1754276082446536000"
        }
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-qcFigures"
        name              = "/aws/lambda/pgxflow-backend-qcFigures"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-qcFigures"
        name                  = "pgxflow-backend-qcFigures"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcFigures"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:06d80dfa6a566569566ea4eda9028fbf4801dced36823f3799101757d83c2a91" -> (known after apply)
      ~ last_modified                  = "2025-07-15T04:02:20.000+0000" -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-qcNotes"
        name              = "/aws/lambda/pgxflow-backend-qcNotes"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-qcNotes"
        name                  = "pgxflow-backend-qcNotes"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2616154766154825722" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1752551954821014800" -> "1754276083085527000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-sendJobEmail"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-sendJobEmail"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-sendJobEmail-0"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "lambda:InvokeFunction"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ap-southeast-3:496940679572:function:cognito-sendClinicJobEmail"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                    },
                  + {
                      + Action   = "cognito-idp:ListUsers"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cognito-idp:ap-southeast-3:496940679572:userpool/ap-southeast-3_Ta5TVYZ4S"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "pgxflow-backend-sendJobEmail"
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-sendJobEmail-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-sendJobEmail"
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes sendJobEmail to send email to user"
      + filename                       = "builds/dbe5a7fe1c70271457859c78a97d99f5fb3bb59ac1969fde460690ec91500c2a.zip"
      + function_name                  = "pgxflow-backend-sendJobEmail"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "COGNITO_CLINIC_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:496940679572:function:cognito-sendClinicJobEmail"
              + "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              + "USER_POOL_ID"                    = "ap-southeast-3_Ta5TVYZ4S"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/sendJobEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/dbe5a7fe1c70271457859c78a97d99f5fb3bb59ac1969fde460690ec91500c2a.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/dbe5a7fe1c70271457859c78a97d99f5fb3bb59ac1969fde460690ec91500c2a.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/dbe5a7fe1c70271457859c78a97d99f5fb3bb59ac1969fde460690ec91500c2a.zip"
          + "timestamp" = "1754276082729813000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-dbsnp will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-dbsnp" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-references-20250519061930040800000001",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250519061930040800000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-gnomad will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-gnomad" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/clinical-workflows/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-lookup will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-lookup" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250519061931564000000002",
              + "arn:aws:s3:::pgxflow-backend-references-20250519061930040800000001",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250519061930040800000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-gnomad",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.results-get will be destroyed
  # (because aws_api_gateway_integration.results-get is not in configuration)
  - resource "aws_api_gateway_integration" "results-get" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "oj2823" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-2y46pa0m1f-oj2823-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "oj2823" -> null
      - rest_api_id             = "2y46pa0m1f" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-getResultsURL/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.results-options will be destroyed
  # (because aws_api_gateway_integration.results-options is not in configuration)
  - resource "aws_api_gateway_integration" "results-options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "oj2823" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-2y46pa0m1f-oj2823-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id             = "oj2823" -> null
      - rest_api_id             = "2y46pa0m1f" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-options will be destroyed
  # (because aws_api_gateway_integration.submit-options is not in configuration)
  - resource "aws_api_gateway_integration" "submit-options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "503fi6" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-2y46pa0m1f-503fi6-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id             = "503fi6" -> null
      - rest_api_id             = "2y46pa0m1f" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-patch will be destroyed
  # (because aws_api_gateway_integration.submit-patch is not in configuration)
  - resource "aws_api_gateway_integration" "submit-patch" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "503fi6" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "PATCH" -> null
      - id                      = "agi-2y46pa0m1f-503fi6-PATCH" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "503fi6" -> null
      - rest_api_id             = "2y46pa0m1f" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initLookup/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-post will be destroyed
  # (because aws_api_gateway_integration.submit-post is not in configuration)
  - resource "aws_api_gateway_integration" "submit-post" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "503fi6" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-2y46pa0m1f-503fi6-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "503fi6" -> null
      - rest_api_id             = "2y46pa0m1f" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initLookup/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.results-get will be destroyed
  # (because aws_api_gateway_integration_response.results-get is not in configuration)
  - resource "aws_api_gateway_integration_response" "results-get" {
      - http_method         = "GET" -> null
      - id                  = "agir-2y46pa0m1f-oj2823-GET-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "oj2823" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.results-options will be destroyed
  # (because aws_api_gateway_integration_response.results-options is not in configuration)
  - resource "aws_api_gateway_integration_response" "results-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-2y46pa0m1f-oj2823-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "oj2823" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-options will be destroyed
  # (because aws_api_gateway_integration_response.submit-options is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-2y46pa0m1f-503fi6-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "503fi6" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-patch will be destroyed
  # (because aws_api_gateway_integration_response.submit-patch is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-patch" {
      - http_method         = "PATCH" -> null
      - id                  = "agir-2y46pa0m1f-503fi6-PATCH-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "503fi6" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-post will be destroyed
  # (because aws_api_gateway_integration_response.submit-post is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-post" {
      - http_method         = "POST" -> null
      - id                  = "agir-2y46pa0m1f-503fi6-POST-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "503fi6" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.results-get will be destroyed
  # (because aws_api_gateway_method.results-get is not in configuration)
  - resource "aws_api_gateway_method" "results-get" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "yx1ubl" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-2y46pa0m1f-oj2823-GET" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "oj2823" -> null
      - rest_api_id          = "2y46pa0m1f" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.results-options will be destroyed
  # (because aws_api_gateway_method.results-options is not in configuration)
  - resource "aws_api_gateway_method" "results-options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-2y46pa0m1f-oj2823-OPTIONS" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "oj2823" -> null
      - rest_api_id          = "2y46pa0m1f" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-options will be destroyed
  # (because aws_api_gateway_method.submit-options is not in configuration)
  - resource "aws_api_gateway_method" "submit-options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-2y46pa0m1f-503fi6-OPTIONS" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "503fi6" -> null
      - rest_api_id          = "2y46pa0m1f" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-patch will be destroyed
  # (because aws_api_gateway_method.submit-patch is not in configuration)
  - resource "aws_api_gateway_method" "submit-patch" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "yx1ubl" -> null
      - http_method          = "PATCH" -> null
      - id                   = "agm-2y46pa0m1f-503fi6-PATCH" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "503fi6" -> null
      - rest_api_id          = "2y46pa0m1f" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-post will be destroyed
  # (because aws_api_gateway_method.submit-post is not in configuration)
  - resource "aws_api_gateway_method" "submit-post" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "yx1ubl" -> null
      - http_method          = "POST" -> null
      - id                   = "agm-2y46pa0m1f-503fi6-POST" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "503fi6" -> null
      - rest_api_id          = "2y46pa0m1f" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.results-get will be destroyed
  # (because aws_api_gateway_method_response.results-get is not in configuration)
  - resource "aws_api_gateway_method_response" "results-get" {
      - http_method         = "GET" -> null
      - id                  = "agmr-2y46pa0m1f-oj2823-GET-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "oj2823" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.results-options will be destroyed
  # (because aws_api_gateway_method_response.results-options is not in configuration)
  - resource "aws_api_gateway_method_response" "results-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-2y46pa0m1f-oj2823-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "oj2823" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.submit-options will be destroyed
  # (because aws_api_gateway_method_response.submit-options is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-2y46pa0m1f-503fi6-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "503fi6" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.submit-patch will be destroyed
  # (because aws_api_gateway_method_response.submit-patch is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-patch" {
      - http_method         = "PATCH" -> null
      - id                  = "agmr-2y46pa0m1f-503fi6-PATCH-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "503fi6" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.submit-post will be destroyed
  # (because aws_api_gateway_method_response.submit-post is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-post" {
      - http_method         = "POST" -> null
      - id                  = "agmr-2y46pa0m1f-503fi6-POST-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "503fi6" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_resource.pipeline_lookup will be destroyed
  # (because aws_api_gateway_resource.pipeline_lookup is not in configuration)
  - resource "aws_api_gateway_resource" "pipeline_lookup" {
      - id          = "goh2ax" -> null
      - parent_id   = "8x2vb66t09" -> null
      - path        = "/pipeline_lookup" -> null
      - path_part   = "pipeline_lookup" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "2y46pa0m1f" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_resource.results will be destroyed
  # (because aws_api_gateway_resource.results is not in configuration)
  - resource "aws_api_gateway_resource" "results" {
      - id          = "oj2823" -> null
      - parent_id   = "goh2ax" -> null
      - path        = "/pipeline_lookup/results" -> null
      - path_part   = "results" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "2y46pa0m1f" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_resource.submit will be destroyed
  # (because aws_api_gateway_resource.submit is not in configuration)
  - resource "aws_api_gateway_resource" "submit" {
      - id          = "503fi6" -> null
      - parent_id   = "goh2ax" -> null
      - path        = "/pipeline_lookup/submit" -> null
      - path_part   = "submit" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "2y46pa0m1f" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.APIGetResultsURL will be destroyed
  # (because aws_lambda_permission.APIGet
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.